Documents/бит_УстановкаСоставаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаСоставаРаботы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СоставРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СоставРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СоставРабот</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_УстановкаСоставаРаботы/Ext/ObjectModule.bsl
#Область ПеременныеМодуля

Перем мВалютаРегламентированногоУчета Экспорт;// Хранит валюту регламентированного учета.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

#Если Клиент Тогда
	
// Процедура осуществляет печать документа. Можно направить печать на. 
// Экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// По переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "" Тогда
		ТабДокумент = "";// Печать();
	КонецЕсли;
	
КонецПроцедуры // Печать()

#КонецЕсли

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура();
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура выполняет проверку заполнения шапки и таб. частей.
//
// Параметры:
// Отказ - булево.
// Заголовок  – Строка.
Процедура ПроверкаРеквизитов(Отказ,Заголовок)
	
	// Проверим заполнение шапки.
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Подразделение");
	СтруктураОбязательныхПолей.Вставить("ВидОбъекта");
	СтруктураОбязательныхПолей.Вставить("Работа");
	СтруктураОбязательныхПолей.Вставить("ЕдиницаИзмерения");
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,  СтруктураОбязательныхПолей,   Отказ, Заголовок);
	
КонецПроцедуры //ПроверкаРеквизитов()

// Проверяет правильность заполнения строк табличной части "Номенклатура".
//
// Параметры: 
//  ТаблицаСтавок - результат запроса, содержащий данные для проведения и проверки ТЧ СтавкиНаУслуги.
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке.
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиНоменклатура(ТаблицаНоменклатуры, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ИмяТабличнойЧасти = "Номенклатура";
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура,Коэффициент,Количество");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Номенклатура", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиНоменклатура()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "СтавкиНаУслуги",
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуНоменклатуры(РезультатЗапросаПоНоменклатуре, СтруктураШапкиДокумента)
	
	ТаблицаНоменклатуры = РезультатЗапросаПоНоменклатуре.Выгрузить();
	
	Возврат ТаблицаНоменклатуры;
	
КонецФункции // ПодготовитьТаблицуНоменклатуры()

// Процедура выполняет заполнение таблицы номенклатура.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаНоменклатуры) Экспорт
	
	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "Номеклатура".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура"	     , "Номенклатура");
	СтруктураПолей.Вставить("Коэффициент"  		 , "Коэффициент");
	СтруктураПолей.Вставить("Количество"         , "Количество");
	
	РезультатЗапросаПоНоменклатуре = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Номенклатура", СтруктураПолей);
	
	// Подготовим таблицы товаров для проведения.
	ТаблицаНоменклатуры      = ПодготовитьТаблицуНоменклатуры(РезультатЗапросаПоНоменклатуре, СтруктураШапкиДокумента);
	
КонецПроцедуры	

// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаНоменклатуры,Отказ,Заголовок)
	
	// Движения по регистру бит_СоставРабот.
	
	НаборЗаписей = Движения.бит_СоставРабот; 
	
	Для Каждого ТекСтрока Из ТаблицаНоменклатуры Цикл
		СтрокаДвижений = НаборЗаписей.Добавить();
		СтрокаДвижений.Период 			      = СтруктураШапкиДокумента.Дата;
		СтрокаДвижений.Подразделение	      = СтруктураШапкиДокумента.Подразделение;
		СтрокаДвижений.ВидОбъекта		      = СтруктураШапкиДокумента.ВидОбъекта;
		СтрокаДвижений.Работа 			      = СтруктураШапкиДокумента.Работа;
		СтрокаДвижений.ЕдиницаИзмерения	      = СтруктураШапкиДокумента.ЕдиницаИзмерения;
		СтрокаДвижений.Номенклатура		      = ТекСтрока.Номенклатура;
		СтрокаДвижений.Коэффициент			  = ТекСтрока.Коэффициент;
		СтрокаДвижений.Количество	 	      = ТекСтрока.Количество;
	КонецЦикла;
	
КонецПроцедуры //ДвиженияПоРегистрам()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаНоменклатуры; // Хранит таблицу номенклатуры.
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ПроверкаРеквизитов(Отказ,Заголовок);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаНоменклатуры);
	
	ПроверитьЗаполнениеТабличнойЧастиНоменклатура(ТаблицаНоменклатуры, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Выполним движения.
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаНоменклатуры,Отказ,Заголовок);
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_ОбщегоНазначения.ПередЗаписьюДокументаДляУдаленияДвиженийПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// БИТ_ЖКХ_12122013_начало_изменений
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнить реквизиты значениями по умолчанию.
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, ""); 
	
КонецПроцедуры
// БИТ_ЖКХ_12122013_окончание_изменений

#КонецОбласти

#Область ОператорыОсновнойПрограммы

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

#КонецОбласти
